AlexSzczesnowicz/filament-mashine-stm32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define IRQ_Pin GPIO_PIN_15
#define IRQ_GPIO_Port GPIOA
#define TFT_RST_Pin GPIO_PIN_8
#define TFT_RST_GPIO_Port GPIOB
#define TOUCH_CS_Pin GPIO_PIN_6
#define TOUCH_CS_GPIO_Port GPIOB
#define TFT_DC_Pin GPIO_PIN_9
#define TFT_DC_GPIO_Port GPIOB
#define TFT_CS_Pin GPIO_PIN_7
#define TFT_CS_GPIO_Port GPIOB
#define led_Pin GPIO_PIN_13
#define led_GPIO_Port GPIOC
#define Relay_2_Pin GPIO_PIN_3
#define Relay_2_GPIO_Port GPIOA
#define Relay_1_Pin GPIO_PIN_2
#define Relay_1_GPIO_Port GPIOA
#define hall2_Pin GPIO_PIN_7
#define hall2_GPIO_Port GPIOA
#define hall1_Pin GPIO_PIN_6
#define hall1_GPIO_Port GPIOA
#define Tranz_2_Pin GPIO_PIN_5
#define Tranz_2_GPIO_Port GPIOA
#define Tranz_1_Pin GPIO_PIN_4
#define Tranz_1_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
